avr-rust/avrd/packs/atmega/AT90USB162.atdf
        <register caption="USB General Control Register" name="USBCON" offset="0xD8" size="1">
          <bitfield caption="" mask="0x80" name="USBE"/>
          <bitfield caption="" mask="0x20" name="FRZCLK"/>
        </register>
        <register caption="Regulator Control Register" name="REGCR" offset="0x63" size="1" ocd-rw="R">
          <bitfield caption="" mask="0x01" name="REGDIS"/>
        </register>
      </register-group>
    </module>
    <module caption="PS/2 Controller" name="PS2">
      <register-group caption="PS/2 Controller" name="PS2">
        <register caption="" name="UPOE" offset="0xFB" size="1">
          <bitfield caption="" mask="0xC0" name="UPWE"/>
          <bitfield caption="" mask="0x30" name="UPDRV"/>
          <bitfield caption="" mask="0x08" name="SCKI"/>
          <bitfield caption="" mask="0x04" name="DATAI"/>
          <bitfield caption="" mask="0x02" name="DPI"/>
          <bitfield caption="" mask="0x01" name="DMI"/>
        </register>
        <register caption="PS2 Pad Enable register" name="PS2CON" offset="0xFA" size="1">
          <bitfield caption="Enable" mask="0x01" name="PS2EN"/>
        </register>
      </register-group>
    </module>
    <module caption="CPU Registers" name="CPU">
      <register-group caption="CPU Registers" name="CPU">
        <register caption="Status Register" name="SREG" offset="0x5F" size="1">
          <bitfield caption="Global Interrupt Enable" mask="0x80" name="I"/>
          <bitfield caption="Bit Copy Storage" mask="0x40" name="T"/>
          <bitfield caption="Half Carry Flag" mask="0x20" name="H"/>
          <bitfield caption="Sign Bit" mask="0x10" name="S"/>
          <bitfield caption="Two's Complement Overflow Flag" mask="0x08" name="V"/>
          <bitfield caption="Negative Flag" mask="0x04" name="N"/>
          <bitfield caption="Zero Flag" mask="0x02" name="Z"/>
          <bitfield caption="Carry Flag" mask="0x01" name="C"/>
        </register>
        <register caption="Stack Pointer " name="SP" offset="0x5D" size="2" mask="0xFFFF"/>
        <register caption="MCU Control Register" name="MCUCR" offset="0x55" size="1">
          <bitfield caption="Pull-up disable" mask="0x10" name="PUD"/>
          <bitfield caption="Interrupt Vector Select" mask="0x02" name="IVSEL"/>
          <bitfield caption="Interrupt Vector Change Enable" mask="0x01" name="IVCE"/>
        </register>
        <register caption="MCU Status Register" name="MCUSR" offset="0x54" size="1">
          <bitfield caption="USB reset flag" mask="0x20" name="USBRF"/>
          <bitfield caption="Watchdog Reset Flag" mask="0x08" name="WDRF"/>
          <bitfield caption="Brown-out Reset Flag" mask="0x04" name="BORF"/>
          <bitfield caption="External Reset Flag" mask="0x02" name="EXTRF"/>
          <bitfield caption="Power-on reset flag" mask="0x01" name="PORF"/>
        </register>
        <register caption="Oscillator Calibration Value" name="OSCCAL" offset="0x66" size="1" mask="0xFF" ocd-rw="R">
          <bitfield caption="Oscillator Calibration " mask="0xFF" name="OSCCAL"/>
        </register>
        <register caption="" name="CLKPR" offset="0x61" size="1" ocd-rw="R">
          <bitfield caption="" mask="0x80" name="CLKPCE"/>
          <bitfield caption="" mask="0x0F" name="CLKPS"/>
        </register>
        <register caption="Sleep Mode Control Register" name="SMCR" offset="0x53" size="1">
          <bitfield caption="Sleep Mode Select bits" mask="0x0E" name="SM" values="CPU_SLEEP_MODE_3BITS"/>
          <bitfield caption="Sleep Enable" mask="0x01" name="SE"/>
        </register>
        <register caption="Extended Indirect Register" name="EIND" offset="0x5C" size="1" mask="0x01"/>
        <register caption="General Purpose IO Register 2" name="GPIOR2" offset="0x4B" size="1">
          <bitfield caption="General Purpose IO Register 2 bis" mask="0xFF" name="GPIOR" lsb="20"/>
        </register>
        <register caption="General Purpose IO Register 1" name="GPIOR1" offset="0x4A" size="1">
          <bitfield caption="General Purpose IO Register 1 bis" mask="0xFF" name="GPIOR" lsb="10"/>
        </register>
        <register caption="General Purpose IO Register 0" name="GPIOR0" offset="0x3E" size="1">
          <bitfield caption="General Purpose IO Register 0 bit 7" mask="0x80" name="GPIOR07"/>
          <bitfield caption="General Purpose IO Register 0 bit 6" mask="0x40" name="GPIOR06"/>
          <bitfield caption="General Purpose IO Register 0 bit 5" mask="0x20" name="GPIOR05"/>
          <bitfield caption="General Purpose IO Register 0 bit 4" mask="0x10" name="GPIOR04"/>
          <bitfield caption="General Purpose IO Register 0 bit 3" mask="0x08" name="GPIOR03"/>
          <bitfield caption="General Purpose IO Register 0 bit 2" mask="0x04" name="GPIOR02"/>
          <bitfield caption="General Purpose IO Register 0 bit 1" mask="0x02" name="GPIOR01"/>
          <bitfield caption="General Purpose IO Register 0 bit 0" mask="0x01" name="GPIOR00"/>
        </register>
        <register caption="Power Reduction Register1" name="PRR1" offset="0x65" size="1">
          <bitfield caption="Power Reduction USB" mask="0x80" name="PRUSB"/>
          <bitfield caption="Power Reduction USART1" mask="0x01" name="PRUSART1"/>
        </register>
        <register caption="Power Reduction Register0" name="PRR0" offset="0x64" size="1">
          <bitfield caption="Power Reduction Timer/Counter0" mask="0x20" name="PRTIM0"/>
          <bitfield caption="Power Reduction Timer/Counter1" mask="0x08" name="PRTIM1"/>
          <bitfield caption="Power Reduction Serial Peripheral Interface" mask="0x04" name="PRSPI"/>
        </register>
        <register caption="" name="CLKSTA" offset="0xD2" size="1" ocd-rw="R">
          <bitfield caption="" mask="0x02" name="RCON"/>
          <bitfield caption="" mask="0x01" name="EXTON"/>
        </register>
        <register caption="" name="CLKSEL1" offset="0xD1" size="1">
          <bitfield caption="" mask="0xF0" name="RCCKSEL"/>
          <bitfield caption="" mask="0x0F" name="EXCKSEL"/>
        </register>
        <register caption="" name="CLKSEL0" offset="0xD0" size="1">
          <bitfield caption="" mask="0xC0" name="RCSUT"/>
          <bitfield caption="" mask="0x30" name="EXSUT"/>
          <bitfield caption="" mask="0x08" name="RCE"/>
          <bitfield caption="" mask="0x04" name="EXTE"/>
          <bitfield caption="" mask="0x01" name="CLKS"/>
        </register>
        <register caption="debugWire communication register" name="DWDR" offset="0x51" size="1" mask="0xFF" ocd-rw=""/>
      </register-group>
      <value-group caption="Oscillator Calibration Values" name="OSCCAL_VALUE_ADDRESSES">
        <value value="0x00" caption="8.0 MHz" name="8_0_MHz"/>
      </value-group>
      <value-group caption="" name="CPU_SLEEP_MODE_3BITS">
        <value caption="Idle" name="IDLE" value="0x00"/>
        <value caption="Reserved" name="VAL_0x01" value="0x01"/>
        <value caption="Power Down" name="PDOWN" value="0x02"/>
        <value caption="Power Save" name="PSAVE" value="0x03"/>
        <value caption="Reserved" name="VAL_0x04" value="0x04"/>
        <value caption="Reserved" name="VAL_0x05" value="0x05"/>
        <value caption="Standby" name="STDBY" value="0x06"/>
        <value caption="Extended Standby" name="ESTDBY" value="0x07"/>
      </value-group>
      <parameters>
        <param name="CORE_VERSION" value="V2"/>
      </parameters>
    </module>
    <module caption="External Interrupts" name="EXINT">
      <register-group caption="External Interrupts" name="EXINT">
        <register caption="External Interrupt Control Register A" name="EICRA" offset="0x69" size="1">
          <bitfield caption="External Interrupt Sense Control Bit" mask="0xC0" name="ISC3"/>
          <bitfield caption="External Interrupt Sense Control Bit" mask="0x30" name="ISC2"/>
          <bitfield caption="External Interrupt Sense Control Bit" mask="0x0C" name="ISC1"/>
          <bitfield caption="External Interrupt Sense Control Bit" mask="0x03" name="ISC0"/>
        </register>
        <register caption="External Interrupt Control Register B" name="EICRB" offset="0x6A" size="1">
          <bitfield caption="External Interrupt 7-4 Sense Control Bit" mask="0xC0" name="ISC7"/>
          <bitfield caption="External Interrupt 7-4 Sense Control Bit" mask="0x30" name="ISC6"/>
          <bitfield caption="External Interrupt 7-4 Sense Control Bit" mask="0x0C" name="ISC5"/>
          <bitfield caption="External Interrupt 7-4 Sense Control Bit" mask="0x03" name="ISC4"/>
        </register>
        <register caption="External Interrupt Mask Register" name="EIMSK" offset="0x3D" size="1">
          <bitfield caption="External Interrupt Request 7 Enable" mask="0xFF" name="INT"/>
        </register>
        <register caption="External Interrupt Flag Register" name="EIFR" offset="0x3C" size="1" ocd-rw="R">
          <bitfield caption="External Interrupt Flags" mask="0xFF" name="INTF"/>
        </register>
        <register caption="Pin Change Mask Register 0" name="PCMSK0" offset="0x6B" size="1">
          <bitfield caption="Pin Change Enable Masks" mask="0xFF" name="PCINT"/>
        </register>
